testCases/wang2015_P50atm/constant/momentumTransport
FoamFile { format ascii; class dictionary; object momentumTransport; }
simulationType  laminar;
