testCases/wang2015_P50atm/0.orig/O2
FoamFile { format ascii; class volScalarField; object O2; }
dimensions [0 0 0 0 0 0 0];
internalField uniform 1;
boundaryField
{
    fuelInlet     { type fixedValue; value uniform 1; }
    oxidizerInlet { type fixedValue; value uniform 1; }
    upperOutflow  { type zeroGradient; }
    lowerOutflow  { type zeroGradient; }
    frontAndBack  { type empty; }
}
