testCases/wang2015_P50atm/system/decomposeParDict
FoamFile { version 2.0; format ascii; class dictionary; object decomposeParDict; }
numberOfSubdomains 8;
method             simple;
simpleCoeffs { n (8 1 1); delta 0.001; }
